Revit 2025 API
FabricationCustomDataType Enumeration
 An enumerated type listing all fabrication custom data value types.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum FabricationCustomDataType
Public Enumeration FabricationCustomDataType
public enum class FabricationCustomDataType
type FabricationCustomDataType
Members
Member name | Value | Description
Text | 1 |  Text data type
Integer | 2 |  Integer data type
Real | 3 |  Real number data type.
See Also
Reference
Autodesk.Revit.DB.Fabrication Namespace